In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
linhas = ['Linha' + str(i) for i in range(5)]

In [6]:
linhas

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [7]:
s = pd.Series(data, index = linhas)

In [8]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [9]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [10]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [11]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [12]:
s1 = s + 2 #somou 2 em cada linha da Series
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [13]:
s2 = s + s1

In [14]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [15]:
data = [[1, 2, 3],  #dataframe a partir de listas
        [4, 5, 6], 
        [7, 8, 9]]

In [16]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [17]:
df1 = pd.DataFrame(data = data)

In [18]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
linhas = ['Linha' + str(i) for i in range(3)]

In [20]:
df1 = pd.DataFrame(data = data, index = linhas)

In [21]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [22]:
colunas = ['Coluna' + str(i) for i in range(3)]

In [23]:
df1 = pd.DataFrame(data = data, index = linhas, columns = colunas)

In [24]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [25]:
data2 = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7}, #dataframe com dicionário (dentro de dicionário)
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8}, 
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data2

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [26]:
df2 = pd.DataFrame(data = data2)

In [27]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [28]:
data3 = [(1, 2, 3),  #dataframe a partir de tuplas
        (4, 5, 6), 
         (7, 8, 9)]

In [29]:
data3

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [30]:
df3 = pd.DataFrame(data = data3, index = linhas, columns = colunas)

In [31]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [32]:
df1[df1 > 0] = 'A'

In [33]:
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [34]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [35]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [36]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [37]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

In [39]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df1

   A  B
X  1  2

In [41]:
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
df2

   C  D
X  3  4

In [51]:
df3 = pd.concat([df1, df2], axis = 1)
df3

   A  B  C  D
X  1  2  3  4

In [52]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [104]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df